grevaillot/svd_tools/headers/STM32H750x/otg1_hs_global.h
#define OTG1_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_MASK		0xffffffff
/** @defgroup otg1_hs_global_otg_hs_cid_product_id PRODUCTID Product ID field
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_glpmcfg OTGHSGLPMCFG OTG core LPM configuration register
@{*/

/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL Enable best effort service latency **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL		(1 << 28)

#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_SHIFT		25
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_MASK		0x07
/** @defgroup otg1_hs_global_otg_hs_glpmcfg_lpmrcntsts LPMRCNTSTS LPM retry count status
@{*/
/**@}*/

/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM Send LPM transaction **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM		(1 << 24)

#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_SHIFT		21
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_MASK		0x07
/** @defgroup otg1_hs_global_otg_hs_glpmcfg_lpmrcnt LPMRCNT LPM retry count
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_SHIFT		17
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_MASK		0x0f
/** @defgroup otg1_hs_global_otg_hs_glpmcfg_lpmchidx LPMCHIDX LPM Channel Index
@{*/
/**@}*/

/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK Sleep State Resume OK **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK		(1 << 16)
/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS Port sleep status **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS		(1 << 15)

#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_SHIFT		13
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_MASK		0x03
/** @defgroup otg1_hs_global_otg_hs_glpmcfg_lpmrst LPMRST LPM response
@{*/
/**@}*/

/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN L1 deep sleep enable **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN		(1 << 12)

#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_SHIFT		8
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_MASK		0x0f
/** @defgroup otg1_hs_global_otg_hs_glpmcfg_beslthrs BESLTHRS BESL threshold
@{*/
/**@}*/

/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN L1 Shallow Sleep enable **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN		(1 << 7)
/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE bRemoteWake value **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE		(1 << 6)

#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_SHIFT		2
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_MASK		0x0f
/** @defgroup otg1_hs_global_otg_hs_glpmcfg_besl BESL Best effort service latency
@{*/
/**@}*/

/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK LPM token acknowledge enable **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK		(1 << 1)
/** OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN LPM support enable **/
#define OTG1_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_global_otg_hs_hptxfsiz OTGHSHPTXFSIZ OTG_HS Host periodic transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_hptxfsiz_ptxfd PTXFD Host periodic TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_hptxfsiz_ptxsa PTXSA Host periodic TxFIFO start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_dieptxf1 OTGHSDIEPTXF1 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf1_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf1_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_dieptxf2 OTGHSDIEPTXF2 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf2_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf2_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_dieptxf3 OTGHSDIEPTXF3 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf3_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf3_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_dieptxf4 OTGHSDIEPTXF4 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf4_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf4_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_dieptxf5 OTGHSDIEPTXF5 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf5_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF5_INEPTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf5_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_dieptxf6 OTGHSDIEPTXF6 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf6_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF6_INEPTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf6_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_global_otg_hs_dieptxf7 OTGHSDIEPTXF7 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXFD_SHIFT		16
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXFD_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf7_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXSA_SHIFT		0
#define OTG1_HS_GLOBAL_OTG_HS_DIEPTXF7_INEPTXSA_MASK		0xffff
/** @defgroup otg1_hs_global_otg_hs_dieptxf7_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/
